## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [1]:
import sqlite3

In [2]:
oma_data = sqlite3.connect("testi.db")

#### Tehtävä 2. Luo yhteys tietokantaan

In [3]:
c = oma_data.cursor()

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [4]:
c.execute("""CREATE TABLE if not exists henkilotaulu (Nimi, Ika, Paino)""")

example_data_rows = [("Teppo", 50, 48), ("Matti", 52, 42), ("Ilona", 29, 41), ("Sonja", 35, 39)]

c.execute('''DELETE FROM henkilotaulu''') # Laitoin tämän rivin, koska seuraava komento lisäsi aina vaan uudestaan nimet, kun ajoin ohjelman.

for data_row in example_data_rows:
    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))
    
oma_data.commit()

data = c.execute('''SELECT * FROM henkilotaulu''')
retrieved_data = data.fetchall()

retrieved_data

[('Teppo', 50, 48), ('Matti', 52, 42), ('Ilona', 29, 41), ('Sonja', 35, 39)]

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [5]:
import pandas as pd

sql_query = '''SELECT * FROM henkilotaulu'''

dataframe_from_sqlite = pd.read_sql(sql_query, oma_data)
dataframe_from_sqlite['Hatunkoko']=[46, 55, 48, 59]
dataframe_from_sqlite

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   50          48         46
1  Matti   52          42         55
2  Ilona   29          41         48
3  Sonja   35          39         59

#### Tehtävä 5. Tee DataFrame-objektista kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla. Tallenna tämä muokattu dataframe-objekti nyt tietokantaan nimellä `henkilotaulukopio` (tulee edellisen taulun rinnalle).

In [6]:
henkilotaulukopio = dataframe_from_sqlite.copy()

#henkilotaulukopio = henkilotaulukopio.append(pd.DataFrame({"Nimi": "Seppo", "Ika": 55, "Kengankoko":43, "Hatunkoko": 50})) / Tämä antoi ValueErrorin.

henkilotaulukopio.loc[len(henkilotaulukopio.index)] = ['Seppo', 55, 43, 50]

henkilotaulukopio.to_sql(name="henkilotaulukopio", con=oma_data, if_exists='replace', index=False)

sql_query = '''SELECT * FROM henkilotaulukopio'''
dataframe_from_sqlite2 = pd.read_sql(sql_query, oma_data)

dataframe_from_sqlite2

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   50          48         46
1  Matti   52          42         55
2  Ilona   29          41         48
3  Sonja   35          39         59
4  Seppo   55          43         50

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [7]:
oma_data.commit()
oma_data.close()